Revit 2024 API
StairsComponentConnection.PeerElementId Property
 The element Id of peer connected stairs component in the stairs connection.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId PeerElementId { get; }
Visual Basic
Public ReadOnly Property PeerElementId As ElementId
	Get
Visual C++
public:
property ElementId^ PeerElementId {
	ElementId^ get ();
}
See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace